package BOT.Objects;

public class FilterList {
    private static String[] List= {
            "간나새끼", "갈보", "개간년", "개년", "개새끼", "씨발", "지랄", "족새", "꼰대",
            "느금마", "니미", "니기미", "닥쳐", "닥처", "대가리"," 등신", "딸딸이", "똘추",
            "메갈", "메갈리아", "미제", "미친", "병신", "보슬", "보추", "불알", "뻐큐",
            "싸이코", "싸기지", "새끼", "씹", "아가리", "양놈", "양아치", "엠창", "워마드",
            "육변기", "자지", "보지", "좆", "쪽바리", "창녀", "창놈", "최순실", "틀딱",
            "한남", "호구", "후장", "후빨",
            "섹스", "시발" ,"시1발", "시 발", "씨1발", "씨잘", "씨벌", "쎅스", "교미"
    };

    public static String[] getList() {
        return List;
    }
}
