//
// Source code recreated from a .class file by IntelliJ IDEA
// (powered by FernFlower decompiler)
//

package com.kirito5572.objects.main;

public class CommandList {
    public static final String[][] CommandData = new String[][]{{"밴", "[권한 필요]서버에 있는 유저를 밴합니다. /밴 [유저] (사유)"}, {"내아이피", "[개발자 전용] 서버 컴퓨터의 네트워크 정보를 띄웁니다."}, {"설정", "[권한 필요] 봇의 서버별 설정을 변경합니다."}, {"청소", "[권한 필요] 이 채널의 메세지를 [숫자] 만큼 삭제합니다. /청소 [숫자]"}, {"역할", "[권한 필요] 명령어로 역할 생성을 진행합니다. /역할 [역할명] [유저명] (#RGB코드) (^권한 등급) ($역할 위치) (역할 분리 표시)"}, {"킥", "[권한 필요] 서버에 있는 유저를 추방합니다. /킥 [유저명]"}, {"멤버카운팅", "[권한 필요] 서버내의 유저를 카운팅합니다. /멤버카운팅 [시작/정지/새로고침]"}, {"핀", "[권한 필요] 특정 채널에 [내용]의 말을 고정시킵니다. /핀 [내용]"}, {"채금", "[권한 필요] 채팅 금지를 먹입니다. /채금 [유저명]"}, {"채팅", "[개발자 전용] 개발자 전용 커맨드"}, {"투표", "[권한 필요] 유저들에게 투표를 하기 위한 명령어입니다. /투표 [투표 내용]"}, {"공개처형", "[권한 필요] 공개처형을 설정/해제합니다 공개처형은,채금의 일종이나, 채팅을 친후 몇초내로 메세지가 삭제됩니다. /공개처형 [유저명]"}, {"언밴", "[권한 필요]서버에서 밴한 유저를 취소합니다. /언밴 [유저명]"}, {"채금해제", "[권한 필요]뮤트를 해제합니다. /채금해제 [유저명]"}, {"setupslash", "[Permission Required] Slash Command Setup/Update Command"}, {"야바위", "주사위를 굴립니다. /야바위 [주사위 최대 숫자] [추첨 횟수]"}, {"홀짝", "홀짝 게임 입니다 /홀짝"}, {"가위바위보", "가위바위보 게입입니다. /가위바위보 [가위/바위/보]"}, {"러시안룰렛", "러시안룰렛 입니다 /러시안룰렛 [재장전/발사]"}, {"공지", "[개발자 전용] 공지 전송용 커맨드"}, {"eval", "[개발자 전용] 디스코드내에서 간단한 코드 실행을 위한 커맨드"}, {"봇서버리스트", "[개발자 전용] 봇이 들어가있는 서버 숫자나 사용하는 유저의 통계 작성용 커맨드입니다."}, {"공기질상세", "입력된 광역시도의 읍면동의 미세먼지 값을 조회합니다. Data from data.go.kr/airkorea.or.kr"}, {"공기질", "시도별 대기정보값을 조회합니다. Data from data.go.kr/airkorea.or.kr"}, {"베타", "베타 기능의 봇 초대"}, {"제작자", "봇 제작자를 호출하는 명령어 입니다. 서버에 제작자 없는 경우 초대 링크가 생성됩니다."}, {"네코", "랜덤 네코 생성기 Image from nekos.life"}, {"색", "닉네임의 색을 변경합니다 /색 [RGB코드/#hex/색깔명]"}, {"색정보", "/색 명령어의 색깔명을 조회합니다."}, {"명령어", "모르는 명령어의 사용법을 검색합니다. /명령어 [명령어]"}, {"초대", "봇 초대 링크를 받아옵니다."}, {"후방주위네코", "[LEWD ONLY] [현재 비활성화] lewd 랜덤 네코 생성기 from nekos.life/lewd"}, {"실검", "네이버의 실시간 검색어 데이터를 조회합니다. from 네이버 데이터랩"}, {"핑", "봇의 명령어 처리 지연시간(네트워크)"}, {"개인정보처리방침", "봇의 개인정보처리방침을 안내합니다"}, {"말", "봇이 대신 말해줍니다."}, {"서버정보", "현재 서버 정보를 출력합니다."}, {"테스트", "테스트 커맨드"}, {"색정리", "사용하지 않는 색 역할을 삭제합니다."}, {"업타임", "봇의 가동시간을 알려줍니다"}, {"유저정보", "유저 정보를 검색합니다."}, {"봇정보", "봇의 정보를 출력합니다."}, {"날씨", "지역의 날씨 정보를 불러옵니다."}};

}
